In [8]:
import pandas as pd
df = pd.read_csv("Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
#Exercise 1
#df.shape[0]
len(df)

891

In [13]:
#Exercise 2
df.columns.tolist()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [18]:
#Exercise 3
youngest_age = df['Age'].min(skipna=True)
print(youngest_age)

0.42

In [20]:
#Exercise 4
oldest_age = df['Age'].max(skipna = True)
print(oldest_age)

80.0

In [23]:
#Exercise 5
average_age = df['Age'].mean().round(2)
print(average_age)

29.7

In [27]:
#Exercise 6
df['Fare'].mode(dropna=True)

0    8.05
Name: Fare, dtype: float64

In [33]:
#Exercise 7
older_than_70 = df.loc[df['Age'] > 70, ['Name', 'Age']]
print(older_than_70)
len(older_than_70)

                                     Name   Age
96              Goldschmidt, Mr. George B  71.0
116                  Connors, Mr. Patrick  70.5
493               Artagaveytia, Mr. Ramon  71.0
630  Barkworth, Mr. Algernon Henry Wilson  80.0
851                   Svensson, Mr. Johan  74.0

5

In [37]:
#Excercise 8
older_than_70 = df.loc[df['Age'] > 70, ['Name', 'Age']]
dff = older_than_70.sort_values(by=['Name'], ascending=[True])
print(dff)

                                     Name   Age
493               Artagaveytia, Mr. Ramon  71.0
630  Barkworth, Mr. Algernon Henry Wilson  80.0
116                  Connors, Mr. Patrick  70.5
96              Goldschmidt, Mr. George B  71.0
851                   Svensson, Mr. Johan  74.0

In [44]:
#Excercise 9
dfff = df.loc[(df['Embarked'] == 'S') & (df['Sex'] == 'male'), ['PassengerId', 'Name']]
dfff

     PassengerId                            Name
0              1         Braund, Mr. Owen Harris
4              5        Allen, Mr. William Henry
6              7         McCarthy, Mr. Timothy J
7              8  Palsson, Master. Gosta Leonard
12            13  Saundercock, Mr. William Henry
..           ...                             ...
878          879              Laleff, Mr. Kristo
881          882              Markun, Mr. Johann
883          884   Banfield, Mr. Frederick James
884          885          Sutehall, Mr. Henry Jr
886          887           Montvila, Rev. Juozas

[441 rows x 2 columns]

In [46]:
#Excercise 10
dfff = df.loc[(df['Sex'] == 'male') & (df['Embarked'] == 'S'), ['PassengerId', 'Name']].head(20)
dfff

    PassengerId                                Name
0             1             Braund, Mr. Owen Harris
4             5            Allen, Mr. William Henry
6             7             McCarthy, Mr. Timothy J
7             8      Palsson, Master. Gosta Leonard
12           13      Saundercock, Mr. William Henry
13           14         Andersson, Mr. Anders Johan
17           18        Williams, Mr. Charles Eugene
20           21                Fynney, Mr. Joseph J
21           22               Beesley, Mr. Lawrence
23           24        Sloper, Mr. William Thompson
27           28      Fortune, Mr. Charles Alexander
29           30                 Todoroff, Mr. Lalio
33           34               Wheadon, Mr. Edward H
35           36      Holverson, Mr. Alexander Oskar
37           38            Cann, Mr. Ernest Charles
45           46            Rogers, Mr. William John
50           51          Panula, Master. Juha Niilo
51           52        Nosworthy, Mr. Richard Cater
55           56                   Woolner, Mr. Hugh
59           60  Goodwin, Master. William Frederick

In [51]:
#Exercise 11
oldest_age = df['Age'].max(skipna=True)
oldest_age

dff = df.loc[df['Age'] == oldest_age, ['Name', 'Age', 'Sex', 'Survived']]
dff

                                     Name   Age   Sex  Survived
630  Barkworth, Mr. Algernon Henry Wilson  80.0  male         1

In [58]:
#Exercise 12
dff = df[df['Survived'] == 1].groupby('Pclass').size()
dff

Pclass
1    136
2     87
3    119
dtype: int64

In [64]:
#Exercise 13
dff = df.groupby(['Embarked','Sex'])['Fare'].mean()
dff

Embarked  Sex
C         female    75.169805
          male      48.262109
Q         female    12.634958
          male      13.838922
S         female    38.740929
          male      21.711996
Name: Fare, dtype: float64

In [65]:
#Exercise 14
dfff = df.groupby('Pclass')['Age'].mean()
dfff

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [67]:
#Exercise 15
df.query('Age < 20')['Name'].head(20)

7                    Palsson, Master. Gosta Leonard
9               Nasser, Mrs. Nicholas (Adele Achem)
10                  Sandstrom, Miss. Marguerite Rut
14             Vestrom, Miss. Hulda Amanda Adolfina
16                             Rice, Master. Eugene
22                      McGowan, Miss. Anna "Annie"
24                    Palsson, Miss. Torborg Danira
27                   Fortune, Mr. Charles Alexander
38               Vander Planke, Miss. Augusta Maria
39                      Nicola-Yarred, Miss. Jamila
43         Laroche, Miss. Simonne Marie Anne Andree
44                    Devaney, Miss. Margaret Delia
49    Arnold-Franchi, Mrs. Josef (Josefine Franchi)
50                       Panula, Master. Juha Niilo
58                     West, Miss. Constance Mirium
59               Goodwin, Master. William Frederick
63                            Skoog, Master. Harald
67                         Crease, Mr. Ernest James
68                  Andersson, Miss. Erna Alexandra
71                       Goodwin, Miss. Lillian Amy
Name: Name, dtype: object

In [69]:
#Exercise 16
grouping = df.groupby('Pclass').agg({
    "Age": ["mean","min"],
    "Fare":"max"

})
grouping

              Age            Fare
             mean   min       max
Pclass
1       38.233441  0.92  512.3292
2       29.877630  0.67   73.5000
3       25.140620  0.42   69.5500